//
//  ProfileValueModel.swift
//  DivingMemoriesApp
//
//  Created by 白石裕幸 on 2021/01/19.
//

import Foundation


struct profileValueModel {
    
    
    let profileValue = [ "sexArray":[" ","男","女"],
    
        "ageArray":[
        " ",
        "10歳","11歳","12歳","13歳","14歳","15歳","16歳","17歳","18歳","19歳",
        "20歳","21歳","22歳","23歳","24歳","25歳","26歳","27歳","28歳","29歳",
        "30歳","31歳","32歳","33歳","34歳","35歳","36歳","37歳","38歳","39歳",
        "40歳","41歳","42歳","43歳","44歳","45歳","46歳","47歳","48歳","49歳",
        "50歳以上"],
    
    
        "OwnedLicenseArray":[
        " ",
        "スクーバ・ダイバー",
        "オープンウォーター・ダイバー",
        "アドバンスド・アドベンチュラー・ダイバー",
        "アドバンスド・オープンウォーター・ダイバー",
        "レスキューダイバー",
        "マスターダイバー",
        "ダイブマスター",
        "アシスタントインストラクター",
        "オープンウォーター・インストラクター",
        "マスター・インストラクター",
        "インストラクター・トレーナー",
        "コースディレクター"],
    
    
      "DivinghistoryArray" :[" ","1年未満","1年〜3年","4年〜5年","5年〜10年","10年以上"]
    
    
    
    
    
    
]
    
    
}

//let sexArray = [" ","男","女"]
//
//let ageArray = [
//    " ",
//    "10歳","11歳","12歳","13歳","14歳","15歳","16歳","17歳","18歳","19歳",
//    "20歳","21歳","22歳","23歳","24歳","25歳","26歳","27歳","28歳","29歳",
//    "30歳","31歳","32歳","33歳","34歳","35歳","36歳","37歳","38歳","39歳",
//    "40歳","41歳","42歳","43歳","44歳","45歳","46歳","47歳","48歳","49歳",
//    "50歳以上"]
//
//
//let OwnedLicenseArray = [
//    " ",
//    "スクーバ・ダイバー",
//    "オープンウォーター・ダイバー",
//    "アドバンスド・アドベンチュラー・ダイバー",
//    "アドバンスド・オープンウォーター・ダイバー",
//    "レスキューダイバー",
//    "マスターダイバー",
//    "ダイブマスター",
//    "アシスタントインストラクター",
//    "オープンウォーター・インストラクター",
//    "マスター・インストラクター",
//    "インストラクター・トレーナー",
//    "コースディレクター"]
//
//
//let DivinghistoryArray = ["1年未満","1年〜3年","4年〜5年","5年〜10年","10年以上"]
